export const categories = [
  {
    type: "الإلكترونيات الاستهلاكية",
    subcategories: [
      "الهواتف المحمولة ولوازمها",
      "أجهزة الصوت والفيديو",
      "الكاميرات والتصوير",
      "الأجهزة القابلة للارتداء",
      "الطائرات بدون طيار ولوازمها",
      "أجهزة التلفزيون والسينما المنزلية",
      "محولات الطاقة وأجهزة الشحن",
      "أجهزة المنزل الذكي",
    ],
  },
  {
    type: "الملابس والإكسسوارات",
    subcategories: [
      "ملابس الرجال",
      "ملابس النساء",
      "ملابس الأطفال",
      "الملابس الداخلية وملابس النوم",
      "الملابس الرياضية",
      "الملابس الخارجية",
      "الأقمشة والمنسوجات",
      "إكسسوارات الموضة",
    ],
  },
  {
    type: "المنزل والحديقة",
    subcategories: [
      "أثاث المنزل",
      "المطبخ والطعام",
      "غرف النوم والحمامات",
      "ديكورات المنزل",
      "أدوات ومعدات الحديقة",
      "التخزين والتنظيم",
      "مواد التنظيف",
      "أثاث الحديقة",
    ],
  },
  {
    type: "التجميل والعناية الشخصية",
    subcategories: [
      "العناية بالبشرة",
      "مستحضرات التجميل",
      "العناية بالشعر",
      "منتجات الأظافر",
      "العطور",
      "العناية بالرجال",
      "أجهزة التجميل والسبا",
      "أدوات وإكسسوارات التجميل",
    ],
  },
  {
    type: "السيارات والدراجات النارية",
    subcategories: [
      "قطع غيار السيارات",
      "إكسسوارات داخلية",
      "إكسسوارات خارجية",
      "قطع وإكسسوارات الدراجات النارية",
      "إلكترونيات السيارات",
      "أدوات الإصلاح",
    ],
  },
  {
    type: "المعدات والمستلزمات الكهربائية",
    subcategories: [
      "المفاتيح والمقابس",
      "الكابلات والأسلاك",
      "أجهزة تحويل الطاقة",
      "معدات التوزيع",
      "الأدوات الكهربائية",
      "المكونات الكهربائية",
      "المولدات",
    ],
  },
  {
    type: "الإضاءة",
    subcategories: [
      "مصابيح وبصيلات LED",
      "الإضاءة التجارية",
      "إضاءة الديكور",
      "الإضاءة الخارجية",
      "إضاءة المسرح والاستوديو",
      "إكسسوارات الإضاءة",
    ],
  },
  {
    type: "أثاث المنزل",
    subcategories: [
      "أثاث غرفة المعيشة",
      "أثاث غرفة النوم",
      "أثاث المكتب",
      "الأثاث الخارجي",
      "أثاث الفنادق",
      "أثاث الأطفال",
      "الأثاث المخصص",
    ],
  },
  {
    type: "الأدوات والمعدات",
    subcategories: [
      "الأدوات اليدوية",
      "الأدوات الكهربائية",
      "أدوات القطع",
      "أدوات القياس",
      "أدوات التثبيت",
      "معدات الورشة",
      "أدوات السلامة",
    ],
  },
  {
    type: "الحقائب والشنط",
    subcategories: [
      "حقائب السفر",
      "حقائب السفر",
      "حقائب اليد النسائية",
      "حقائب الظهر",
      "حقائب العمل",
      "الحقائب الرياضية",
      "إكسسوارات الحقائب",
    ],
  },
  {
    type: "المجوهرات والساعات والنظارات",
    subcategories: [
      "مجوهرات الموضة",
      "الساعات",
      "النظارات",
      "مكونات المجوهرات",
      "تعبئة المجوهرات",
    ],
  },
  {
    type: "أجهزة الحاسوب",
    subcategories: [
      "أجهزة اللاب توب والنوت بوك",
      "أجهزة الحاسوب المكتبية",
      "مكونات الحاسوب",
      "الأجهزة الملحقة (ماوس، كيبورد)",
      "معدات الشبكات",
      "البرمجيات والحلول",
    ],
  },
  {
    type: "مستلزمات المكتب والمدرسة",
    subcategories: [
      "أدوات الكتابة",
      "أجهزة المكتب",
      "مستلزمات الفصل الدراسي",
      "أثاث المكتب",
      "مستلزمات الطباعة",
    ],
  },
  {
    type: "الرياضة والترفيه",
    subcategories: [
      "معدات اللياقة البدنية",
      "إكسسوارات الرياضة الخارجية",
      "الآلات الموسيقية",
    ],
  },
  {
    type: "التعبئة والطباعة",
    subcategories: [
      "مواد التعبئة",
      "الأكياس والأغلفة",
      "الصناديق والكرتون",
      "خدمات الطباعة",
      "الملصقات واللاصقات",
    ],
  },
  {
    type: "الطعام والشراب",
    subcategories: ["المشروبات", "الوجبات الخفيفة", "الأطعمة المجمدة"],
  },
  {
    type: "المنتجات الكيميائية",
    subcategories: ["مواد التنظيف"],
  },
  {
    type: "الزراعة",
    subcategories: [
      "البذور والبصيلات",
      "الفواكه والخضار الطازجة",
      "الأعلاف والنباتات",
      "معدات الزراعة",
    ],
  },
  {
    type: "الهدايا والحرف اليدوية",
    subcategories: [
      "مواد الحرف اليدوية",
      "التذكارات",
      "الإكسسوارات الإعلانية",
      "هدايا المواسم",
    ],
  },
  {
    type: "الأمن والحماية",
    subcategories: [
      "معدات المراقبة",
      "إكسسوارات الحماية الشخصية",
      "أنظمة التحكم في الوصول",
      "سلامة الحرائق",
    ],
  },
  {
    type: "الأجهزة المنزلية",
    subcategories: [
      "أجهزة المطبخ",
      "أجهزة التنظيف",
      "الأجهزة المنزلية الصغيرة",
      "أجهزة تكييف الهواء",
      "سخانات المياه",
    ],
  },
  {
    type: "الطاقة المتجددة",
    subcategories: [
      "ألواح الطاقة الشمسية",
      "معدات طاقة الرياح",
      "البطاريات والتخزين",
      "المحولات وأجهزة التحكم",
    ],
  },
  {
    type: "المنسوجات والجلود",
    subcategories: ["الأقمشة", "إكسسوارات الملابس", "منتجات الجلد"],
  },
  {
    type: "الحيوانات الأليفة",
    subcategories: [
      "طعام الحيوانات الأليفة",
      "ألعاب الحيوانات الأليفة",
      "نظافة الحيوانات الأليفة",
      "إكسسوارات الحيوانات الأليفة",
    ],
  },
  {
    type: "أخرى",
    subcategories: ["متنوعة", "موسمية", "وصول جديد"],
  },
];
export const getSubcategoriesForType = (type) => {
  const cat = categories.find((c) => c.type === type);

  if (!cat) {
    console.error("Category not found for type:", type);
    return []; // Return an empty array if the category is not found
  }

  return cat ? cat.subcategories : [];
};
