// src/data/alibabaCategories.js
export const categories = [
  {
    type: "ئەلیکترۆنی بەکارهێنەر",
    subcategories: [
      "مۆبایل و پێداویستیەکانی",
      "ئامێرەکانی دەنگ و ڤیدیۆ",
      "کامێرا و وێنەگرتن",
      "ئامێرە لەشبەستراوەکان",
      "فڕۆکە بێ فڕۆکەوان و پێداویستیەکانی",
      "تەلەڤزیۆن و سینەمای ماڵەوە",

      "ئەداپتەرەکانی وزە و پڕکەر",
      "ئامێرەکانی ماڵی زیرەک",
    ],
  },
  {
    type: "جلوبەرگ و کەلوپەل",
    subcategories: [
      "جلوبەرگی پیاوان",
      "جلوبەرگی ئافرەتان",
      "جلوبەرگی منداڵان",
      "جلی ژوورەوە و خەوتن",
      "جلی وەرزشی",
      "پۆشاکی دەرەوە",

      "قوماش و چڕکراو",
      "کەلوپەلی فاشن",
    ],
  },
  {
    type: "ماڵ و باخچە",
    subcategories: [
      "کەلوپەلی ماڵ",
      "چێشتخانە و خواردن",
      "جێخەوتن و حەمام",
      "ڕازاندنەوەی ماڵ",
      "ئامراز و کەرەستەی باخچە",
      "هەڵگرتن و ڕێکخستن",
      "کەرەستەی پاککردنەوە",
      "کەلوپەلی باخچە",
    ],
  },
  {
    type: "جوانکاری و چاودێری کەسی",
    subcategories: [
      "چاودێری پێست",
      "مەکیاج",
      "چاودێری قژ",
      "بەرهەمەکانی نینۆک",
      "بۆنخۆشی",
      "پاکی پیاوان",
      "ئامێرەکانی جوانکاری و سپرا",
      "ئامراز و کەلوپەلی جوانکاری",
    ],
  },

  {
    type: "ئۆتۆمبێل و مۆتۆرسایکل",
    subcategories: [
      "پارچەکانی ئۆتۆمبێل",
      "کەلوپەلی ناوەوە",
      "کەلوپەلی دەرەوە",
      "پارچە و کەلوپەلی مۆتۆرسایکل",
      "ئەلیکترۆنی ئۆتۆمبێل",

      "ئامرازەکانی چاککردنەوە",
    ],
  },

  {
    type: "کەرەستەی کارەبا",
    subcategories: [
      "سویچ و پلاک",
      "کێبڵ و وایەر",
      "پارچەکانی گۆڕینی وزە",
      "ئامێرەکانی دابەشکردن",
      "ئامرازەکانی کارەبا",
      "پێکهاتەکانی کارەبا",
      "مۆلیدەکان",
    ],
  },

  {
    type: "ڕووناکی",
    subcategories: [
      "گڵۆپ و ئاسایی LED",
      "ڕووناکی بازرگانی",
      "ڕووناکی ڕازاندنەوە",
      "ڕووناکی دەرەوە",
      "ڕووناکی شانۆ و ستودیۆ",
      "کەلوپەلی ڕووناکی",
    ],
  },
  {
    type: "کەلوپەلی ماڵ",
    subcategories: [
      "کەلوپەلی ژووری دانیشتن",
      "کەلوپەلی ژووری خەوتن",
      "کەلوپەلی نووسینگە",
      "کەلوپەلی دەرەوە",
      "کەلوپەلی هوتێل",
      "کەلوپەلی منداڵان",
      "کەلوپەلی دروستکراو",
    ],
  },
  {
    type: "ئامراز و کەرەستە",
    subcategories: [
      "ئامرازەکانی دەست",
      "ئامرازەکانی کارەبا",
      "ئامرازەکانی بڕین",
      "ئامرازەکانی پێوانە",
      "ئامرازەکانی جێگیرکردن",
      "کەرەستەی کارگە",
      "ئامرازەکانی سەلامەتی",
    ],
  },
  {
    type: "چەمەدان و جانتا",
    subcategories: [
      "چەمەدان",
      "جانتای گەشتی",
      "جانتای دەستی ئافرەتان",
      "جانتای پشت",
      "جانتای بازرگانی",
      "جانتای وەرزشی",
      "کەلوپەلی جانتا",
    ],
  },
  {
    type: "خشڵ و کاتژمێر و چاویلکە",
    subcategories: [
      "خشڵی فاشن",
      "کاتژمێر",
      "چاویلکە",
      "پێکهاتەکانی خشڵ",
      "پاکەتی خشڵ",
    ],
  },
  {
    type: "کۆمپیوتەر",
    subcategories: [
      "لاپتۆپ و نۆتبووک",
      "کۆمپیوتەری سەر مێز",
      "پێکهاتەکانی کۆمپیوتەر",
      "ئامێرە لاوەکیەکان (ماوس، کیبۆرد)",
      "کەرەستەی تۆڕ",
      "سۆفتوێر و چارەسەرەکان",
    ],
  },
  {
    type: "کەرەستەی نووسینگە و قوتابخانە",
    subcategories: [
      "کەرەستەی نووسین",
      "ئامێرەکانی نووسینگە",
      "کەرەستەی پۆل",
      "کەلوپەلی نووسینگە",
      "کەرەستەی چاپکردن",
    ],
  },
  {
    type: "وەرزش و کاتبەسەرانی",
    subcategories: [
      "ئامێرەکانی لەشسازی",
      "کەلوپەلی وەرزشی دەرەوە",

      "ئامێرەکانی مۆسیقا",
    ],
  },

  {
    type: "پاکەتکردن و چاپکردن",
    subcategories: [
      "مادەکانی پاکەتکردن",
      "کیس و بەرگ",
      "سندووق و کارتۆن",
      "خزمەتگوزاری چاپکردن",
      "لیبڵ و ستیکەر",
    ],
  },
  {
    type: "خواردن و خواردنەوە",
    subcategories: ["خواردنەوەکان", "خواردنی وردە", "خواردنی بەستوو"],
  },
  {
    type: "بەرهەمە کیمیاییەکان",
    subcategories: ["مادەی پاککەرەوە"],
  },

  {
    type: "کشتوکاڵ",
    subcategories: [
      "تۆو و پیازۆک",
      "میوە و سەوزەی تازە",
      "خۆراک و گیا",
      "ئامێرەکانی کشتوکاڵ",
    ],
  },
  {
    type: "دیاری و کاری دەستی",
    subcategories: [
      "کەرەستەی کاری دەستی",
      "یادگاری",
      "کەلوپەلی ڕیکلامی",
      "دیاری وەرزی",
    ],
  },
  {
    type: "ئاسایش و پاراستن",
    subcategories: [
      "ئامێرەکانی چاودێری",
      "کەلوپەلی پاراستنی کەسی",
      "کۆنترۆڵی دەستگەیشتن",
      "سەلامەتی ئاگر",
    ],
  },

  {
    type: "ئامێرەکانی ماڵەوە",
    subcategories: [
      "ئامێرەکانی چێشتخانە",
      "ئامێرەکانی پاککردنەوە",
      "ئامێرە بچووکەکانی ماڵەوە",
      "ئەیەر کۆندیشن",
      "ئاوگەرمکەر",
    ],
  },
  {
    type: "وزەی نوێکراوە",
    subcategories: [
      "پانێلەکانی وزەی خۆر",
      "ئامێرەکانی وزەی با",
      "پاتری و هەڵگرتن",
      "ئینڤەرتەر و کۆنترۆڵکەر",
    ],
  },

  {
    type: "چڕکراو و چەرم",
    subcategories: ["قوماش", "کەلوپەلی جلوبەرگ", "کەلوپەلی چەرمی"],
  },
  {
    type: "ئاژەڵی ماڵی",
    subcategories: [
      "خۆراکی ئاژەڵی ماڵی",
      "یاری ئاژەڵی ماڵی",
      "پاکی ئاژەڵی ماڵی",
      "کەلوپەلی ئاژەڵی ماڵی",
    ],
  },

  {
    type: "هیتر",
    subcategories: ["جۆراوجۆر", "وەرزی", "گەیشتنی نوێ"],
  },
];

export const getSubcategoriesForType = (type) => {
  const cat = categories.find((c) => c.type === type);
  if (!cat) {
    console.error("Category not found for type:", type);
    return [];
  }
  return cat.subcategories;
};
